var len;

const morsecodeMap = {
"あ":"ーー・ーー","い":"・ー","う":"・・ー","え":"ー・ーーー","お":"・ー・・・",
"か":"・ー・・","き":"ー・ー・・","く":"・・・ー","け":"ー・ーー","こ":"ーーーー",
"さ":"ー・ー・ー","し":"ーー・ー・","す":"ーーー・ー","せ":"・ーーー・","そ":"ーーー・",
"た":"ー・","ち":"・・ー・","つ":"・ーー・","て":"・ー・ーー","と":"・・ー・・",
"な":"・ー・","に":"ー・ー・","ぬ":"・・・・","ね":"ーー・ー","の":"・・ーー",
"は":"ー・・・","ひ":"ーー・・ー","ふ":"ーー・・","へ":"・","ほ":"ー・・",
"ま":"ー・・ー","み":"・・ー・ー","む":"ー","め":"ー・・・ー","も":"ー・・ー・",
"や":"・ーー","ゆ":"ー・・ーー","よ":"ーー",
"ら":"・・・","り":"ーー・","る":"ー・ーー・","れ":"ーーー","ろ":"・ー・ー",
"わ":"ー・ー","ゐ":"・ー・・ー","ゑ":"・ーー・・","を":"・ーーー","ん":"・ー・ー・",

"゛":"・・",//濁点
"゜":"・・ーー・",//半濁点
"ー":"・ーー・ー",//長音
"、":"・ー・ー・ー"//読点
};


function getRandomInt(max) {
  return Math.floor(Math.random() * max);
}

const examples = [
  {text1 : "今日はりんごを食べました", text2 : "きようはりんこ゛をたへ゛ました", morse : 
"ー・ー・・ーー・・ーー・・・ーー・・ー・ー・ーーーー・・・ーーーー・・・・ー・・ーーー・ー・ー・"},
  {text1 : "友達をぶった", text2 : "ともた゛ちをふ゛つた", morse : 
"・・ー・・ー・・ー・ー・・・・・ー・・ーーーーー・・・・・ーー・ー・"}
];

var Qtext = examples[getRandomInt(examples.length)];

//変換用
const mapString = (str) => 
  str.split("").map((a) => {
    return morsecodeMap[a]
  }).join("");

const cnv = () => {
  let list = [];
  let texts = examples.map((text) => {
    return text.text2;
  });
  for(let i = 0; i < texts.length; i++){
    let text = texts[i];
    let morseText = mapString(text);
    list.push(morseText);
  }
  console.log(list);
}

console.log(cnv());