var len;

const morsecodeMap = {"あ":"ーー・・ーー","い":"ーー・","う":"・・ー","え":"ー・ーーー","お":"・ーー・・",
"か":"・ーー・・","き":"ー・ーー・・","く":"・・・ー","け":"ー・ーー","こ":"ーーーー",
"さ":"ー・ー・ー","し":"ーー・ー・","す":"ーーー・ー","せ":"・ーーー・","そ":"ーーー・",
"た":"ー・","ち":"・・ー・","つ":"・ーー・","て":"・ー・ーー","と":"・・ー・・",
"な":"・ー・","に":"ー・ー・","ぬ":"・・・・","ね":"ーー・ー","の":"・・ーー",
"は":"・・・・","ひ":"ーー・・","ふ":"ーー・・","へ":"・","ほ":"・・・",
"ま":"・・・ー","み":"・・ー・ー","む":"ー","め":"・・・・ー","も":"・・・ー・",
"や":"・ーー","ゆ":"・・・ーー","よ":"ーー",
"ら":"・・・","り":"ーー・","る":"ー・ーー・","れ":"ーーー","ろ":"・ー・ー",
"わ":"ー・ー","ゐ":"・ーー・ー","ゑ":"・ーーー・・","を":"・ーーー","ん":"・ー・ー・",
"゛": "・・",      // 濁点
"゜": "・・ーー・",  // 半濁点
"ー":"・ーー・ー" // 長音符号
};

function getRandomInt(max) {
  return Math.floor(Math.random() * max);
}


const examples = [
  {text1 : "今日はりんごを食べました", text2 : "きようはりんこ゛をたへ゛ました", morse : 
"ー・ーー・・ーー・・ー・・・・ーー・・ー・ー・ーーーー・・・ーーーー・・・・・・・ーーー・ー・ー・"},
  {text1 : "友達をぶった", text2 : "ともた゛ちをふ゛つた", morse : 
"・・ー・・・・・ー・ー・・・・・ー・・ーーーーー・・・・・ーー・ー・"}
];


//変換用
const mapString = (str) => 
  str.split("").map((a) => {
    return morsecodeMap[a]
  }).join("");

const cnv = () => {
  let list = [];
  let texts = examples.map((text) => {
    return text.text2;
  });
  for(let i = 0; i < texts.length; i++){
    let text = texts[i];
    let morseText = mapString(text);
    list.push(morseText);
  }
  console.log(list);
}

console.log(cnv());